# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd 
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [4]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [5]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [8]:
baby_names.drop(['Unnamed: 0','Id'],axis=1,inplace=True)

### Step 6. Is there more male or female names in the dataset?

In [10]:
baby_names.Gender.value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [30]:
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

In [12]:
names = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [13]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [36]:
names.agg({'Count':'sum'}).reset_index().sort_values(by='Count',ascending=False)

             Name   Count
7198        Jacob  242874
5378         Emma  214852
12111     Michael  214405
5579        Ethan  209277
6973     Isabella  204798
...           ...     ...
5453       Eniola       5
2037     Atlantis       5
11478       Marci       5
15236  Simarpreet       5
13010        Nita       5

[17632 rows x 2 columns]

In [37]:
names.agg({'Count':'sum'}).idxmax()

Count    Jacob
dtype: object

In [45]:
n = names.agg({'Count':'sum'}).reset_index().sort_values(by='Count',ascending=True)
len(n.loc[n.Count==n.Count.min()])

2578

### Step 10. How many different names have the least occurrences?

In [29]:
n = names.count().reset_index()[['Name','Count']].sort_values(by='Count',ascending=True)

            Name  Count
9252   Katherina      1
2875     Breyona      1
6284      Greidy      1
15160    Shriyan      1
2878       Briah      1
...          ...    ...
6584      Hayden   1049
13459     Peyton   1064
8500      Jordan   1073
2174       Avery   1080
14062      Riley   1112

[17632 rows x 2 columns]

### Step 11. What is the median name occurrence?

In [55]:
n[n.Count == n.Count.median()]

             Name  Count
3143       Caleah     49
1360        Anely     49
986        Alysse     49
5396    Emmanuela     49
3292      Carlota     49
...           ...    ...
14639  Sanjuanita     49
8138      Jeovany     49
4416       Deante     49
7353        Jaice     49
10649    Leylanie     49

[66 rows x 2 columns]

### Step 12. What is the standard deviation of names?

In [56]:
n.Count.std()

11006.06946789057

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [58]:
n.Count.describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64